{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "os.environ[\"NEO4J_URI\"] = \"bolt://localhost:7687\"\n",
    "os.environ[\"NEO4J_USERNAME\"] = \"neo4j\"\n",
    "os.environ[\"NEO4J_PASSWORD\"] = \"2wsx3edc\"\n",
    "\n",
    "database = os.environ.get('NEO4J_DATABASE')\n",
    "graph = Neo4jGraph(database=database)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience \n",
    "\n",
    "gds = GraphDataScience( \n",
    "    os.environ[ \"NEO4J_URI\" ], \n",
    "    auth=(os.environ[ \"NEO4J_USERNAME\" ], os.environ[ \"NEO4J_PASSWORD\" ]) \n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [],
   "source": [
    "gds.graph.drop(\"communities\")\n",
    "G, result = gds.graph.project(\n",
    "    \"communities\",  #  Graph name\n",
    "    \"__Entity__\",  #  Node projection\n",
    "    {\n",
    "        \"_ALL_\": {\n",
    "            \"type\": \"*\",\n",
    "            \"orientation\": \"UNDIRECTED\",\n",
    "            \"properties\": {\"weight\": {\"property\": \"*\", \"aggregation\": \"COUNT\"}},\n",
    "        }\n",
    "    },\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Component count: 287\n",
      "Component distribution: {'min': 1, 'p5': 1, 'max': 185, 'p999': 185, 'p99': 14, 'p1': 1, 'p10': 1, 'p90': 1, 'p50': 1, 'p25': 1, 'p75': 1, 'p95': 1, 'mean': 1.9407665505226481}\n"
     ]
    }
   ],
   "source": [
    "wcc = gds.wcc.stats(G)\n",
    "print(f\"Component count: {wcc['componentCount']}\")\n",
    "print(f\"Component distribution: {wcc['componentDistribution']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "writeMillis                                                             95\n",
       "nodePropertiesWritten                                                  557\n",
       "ranLevels                                                                3\n",
       "didConverge                                                           True\n",
       "nodeCount                                                              557\n",
       "communityCount                                                         296\n",
       "communityDistribution    {'min': 1, 'p5': 1, 'max': 45, 'p999': 45, 'p9...\n",
       "modularity                                                        0.718684\n",
       "modularities             [0.6312269964407168, 0.7122485060806366, 0.718...\n",
       "postProcessingMillis                                                    46\n",
       "preProcessingMillis                                                      1\n",
       "computeMillis                                                          142\n",
       "configuration            {'writeProperty': 'communities', 'theta': 0.01...\n",
       "Name: 0, dtype: object"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds.leiden.write(\n",
    "    G,\n",
    "    writeProperty=\"communities\",\n",
    "    includeIntermediateCommunities=True,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(*)': 1671}]"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "MATCH (e:`__Entity__`)\n",
    "UNWIND range(0, size(e.communities) - 1 , 1) AS index\n",
    "CALL {\n",
    "  WITH e, index\n",
    "  WITH e, index\n",
    "  WHERE index = 0\n",
    "  MERGE (c:`__Community__` {id: toString(index) + '-' + toString(e.communities[index])})\n",
    "  ON CREATE SET c.level = index\n",
    "  MERGE (e)-[:IN_COMMUNITY]->(c)\n",
    "  RETURN count(*) AS count_0\n",
    "}\n",
    "CALL {\n",
    "  WITH e, index\n",
    "  WITH e, index\n",
    "  WHERE index > 0\n",
    "  MERGE (current:`__Community__` {id: toString(index) + '-' + toString(e.communities[index])})\n",
    "  ON CREATE SET current.level = index\n",
    "  MERGE (previous:`__Community__` {id: toString(index - 1) + '-' + toString(e.communities[index - 1])})\n",
    "  ON CREATE SET previous.level = index - 1\n",
    "  MERGE (previous)-[:IN_COMMUNITY]->(current)\n",
    "  RETURN count(*) AS count_1\n",
    "}\n",
    "RETURN count(*)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "MATCH (c:__Community__)<-[:IN_COMMUNITY*]-(:__Entity__)<-[:HAS_ENTITY]-(d:__Chunk__)\n",
    "WITH c, count(distinct d) AS rank\n",
    "SET c.rank = rank;\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Level</th>\n",
       "      <th>Number of communities</th>\n",
       "      <th>25th Percentile</th>\n",
       "      <th>50th Percentile</th>\n",
       "      <th>75th Percentile</th>\n",
       "      <th>90th Percentile</th>\n",
       "      <th>99th Percentile</th>\n",
       "      <th>Max</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>331</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>4.0</td>\n",
       "      <td>18.90</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>329</td>\n",
       "      <td>3.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>10.2</td>\n",
       "      <td>41.00</td>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>303</td>\n",
       "      <td>8.0</td>\n",
       "      <td>10.0</td>\n",
       "      <td>17.5</td>\n",
       "      <td>28.0</td>\n",
       "      <td>61.96</td>\n",
       "      <td>81</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Level  Number of communities  25th Percentile  50th Percentile  \\\n",
       "0     0                    331              1.0              1.0   \n",
       "1     1                    329              3.0              3.0   \n",
       "2     2                    303              8.0             10.0   \n",
       "\n",
       "   75th Percentile  90th Percentile  99th Percentile  Max  \n",
       "0              1.0              4.0            18.90   33  \n",
       "1              3.0             10.2            41.00   49  \n",
       "2             17.5             28.0            61.96   81  "
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "\n",
    "community_size = graph.query(\n",
    "    \"\"\"\n",
    "MATCH (c:__Community__)<-[:IN_COMMUNITY*]-(e:__Entity__)\n",
    "WITH c, count(distinct e) AS entities\n",
    "RETURN split(c.id, '-')[0] AS level, entities\n",
    "\"\"\"\n",
    ")\n",
    "community_size_df = pd.DataFrame.from_records(community_size)\n",
    "percentiles_data = []\n",
    "for level in community_size_df[\"level\"].unique():\n",
    "    subset = community_size_df[community_size_df[\"level\"] == level][\"entities\"]\n",
    "    num_communities = len(subset)\n",
    "    percentiles = np.percentile(subset, [25, 50, 75, 90, 99])\n",
    "    percentiles_data.append(\n",
    "        [\n",
    "            level,\n",
    "            num_communities,\n",
    "            percentiles[0],\n",
    "            percentiles[1],\n",
    "            percentiles[2],\n",
    "            percentiles[3],\n",
    "            percentiles[4],\n",
    "            max(subset)\n",
    "        ]\n",
    "    )\n",
    "\n",
    "# Create a DataFrame with the percentiles\n",
    "percentiles_df = pd.DataFrame(\n",
    "    percentiles_data,\n",
    "    columns=[\n",
    "        \"Level\",\n",
    "        \"Number of communities\",\n",
    "        \"25th Percentile\",\n",
    "        \"50th Percentile\",\n",
    "        \"75th Percentile\",\n",
    "        \"90th Percentile\",\n",
    "        \"99th Percentile\",\n",
    "        \"Max\"\n",
    "    ],\n",
    ")\n",
    "percentiles_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'communityId': '1-259',\n",
       " 'nodes': [{'id': '單側疝氣',\n",
       "   'description': '8%',\n",
       "   'type': 'Medical_procedure',\n",
       "   'sources': ['台灣人壽新住院醫療保險附約.pdf']},\n",
       "  {'id': '精神疾病',\n",
       "   'description': '因本人或其配偶患有礙優生之遺傳性、傳染性疾病或精神疾病',\n",
       "   'type': 'Condition',\n",
       "   'sources': ['台灣人壽龍實在住院醫療健康保險附約.pdf']},\n",
       "  {'id': '流產',\n",
       "   'description': '因醫療行為所必要之流產',\n",
       "   'type': 'Event',\n",
       "   'sources': ['台灣人壽龍實在住院醫療健康保險附約.pdf', '台灣人壽新住院醫療保險附約.pdf']},\n",
       "  {'id': '遺傳性疾病',\n",
       "   'description': '因本人或其配偶患有礙優生之遺傳性、傳染性疾病或精神疾病',\n",
       "   'type': 'Condition',\n",
       "   'sources': ['台灣人壽龍實在住院醫療健康保險附約.pdf']},\n",
       "  {'id': '傳染性疾病',\n",
       "   'description': '因本人或其配偶患有礙優生之遺傳性、傳染性疾病或精神疾病',\n",
       "   'type': 'Condition',\n",
       "   'sources': ['台灣人壽龍實在住院醫療健康保險附約.pdf']},\n",
       "  {'id': '四親等以內之血親',\n",
       "   'description': '因本人或其配偶之四親等以內之血親患有礙優生之遺傳性疾病',\n",
       "   'type': 'Person',\n",
       "   'sources': ['台灣人壽龍實在住院醫療健康保險附約.pdf']},\n",
       "  {'id': '醫療行為所必要之流產', 'type': 'Event', 'sources': ['台灣人壽新住院醫療保險附約.pdf']},\n",
       "  {'id': '本人或其配偶患有礙優生之遺傳性、傳染性疾病或精神疾病',\n",
       "   'type': 'Event',\n",
       "   'sources': ['台灣人壽新住院醫療保險附約.pdf']},\n",
       "  {'id': '本人或其配偶之四親等以內之血親患有礙優生之遺傳性疾病',\n",
       "   'type': 'Event',\n",
       "   'sources': ['台灣人壽新住院醫療保險附約.pdf']}],\n",
       " 'rels': []}"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "community_info = graph.query(\"\"\"\n",
    "MATCH (c:`__Community__`)<-[:IN_COMMUNITY*]-(e:__Entity__)\n",
    "WITH c, collect(e ) AS nodes\n",
    "WHERE size(nodes) > 1\n",
    "CALL apoc.path.subgraphAll(nodes[0], {\n",
    " whitelistNodes:nodes\n",
    "})\n",
    "YIELD relationships\n",
    "RETURN c.id AS communityId, \n",
    "       [n in nodes | apoc.map.removeKeys(n{.*, type: [el in labels(n) WHERE el <> '__Entity__'][0]}, ['embedding', 'wcc', 'communities'])] AS nodes,\n",
    "       [r in relationships | {start: startNode(r).id, type: type(r), end: endNode(r).id, description: r.description}] AS rels\n",
    "\"\"\")\n",
    "community_info[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "\n",
    "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
    "# from langchain_openai import ChatOpenAI\n",
    "from langchain_openai import AzureChatOpenAI\n",
    "\n",
    "llm = AzureChatOpenAI(\n",
    "    azure_endpoint=os.environ[\"AZURE_OPENAI_ENDPOINT\"],\n",
    "    azure_deployment=os.environ[\"AZURE_OPENAI_DEPLOYMENT_NAME\"],\n",
    "    openai_api_version=os.environ[\"AZURE_OPENAI_API_VERSION\"],\n",
    "    temperature=0\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# from langchain_experimental.llms.ollama_functions import OllamaFunctions\n",
    "# model_name = 'qwen2:72b-instruct-q8_0'\n",
    "# llm = OllamaFunctions(model=model_name, temperature=0)\n",
    "# llm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "\n",
    "community_template = \"\"\"\n",
    "{community_info}\n",
    "Summary:\"\"\"  # noqa: E501\n",
    "\n",
    "community_prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            \"請根據提供同社區的資訊包含 nodes 與 relationships, 產生同社區的自然語言的摘要資訊, 需要區分共同資訊以及各來源的資訊. No pre-amble.\",\n",
    "        ),\n",
    "        (\n",
    "            \"system\", \"使用繁體中文回應\"\n",
    "        ),\n",
    "        (\"human\", community_template),\n",
    "    ]\n",
    ")\n",
    "\n",
    "community_chain = community_prompt | llm | StrOutputParser()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'community': '1-259',\n",
       " 'summary': '共同資訊:\\n- 流產: 因醫療行為所必要之流產，出現在兩個來源文件中（台灣人壽龍實在住院醫療健康保險附約.pdf 和 台灣人壽新住院醫療保險附約.pdf）。\\n- 遺傳性疾病、傳染性疾病、精神疾病: 因本人或其配偶患有礙優生之遺傳性、傳染性疾病或精神疾病，出現在台灣人壽龍實在住院醫療健康保險附約.pdf 中。\\n\\n不同來源的資訊:\\n- 單側疝氣: 8%，僅出現在台灣人壽新住院醫療保險附約.pdf 中。\\n- 四親等以內之血親: 因本人或其配偶之四親等以內之血親患有礙優生之遺傳性疾病，僅出現在台灣人壽龍實在住院醫療健康保險附約.pdf 中。\\n- 醫療行為所必要之流產: 僅出現在台灣人壽新住院醫療保險附約.pdf 中。\\n- 本人或其配偶患有礙優生之遺傳性、傳染性疾病或精神疾病: 僅出現在台灣人壽新住院醫療保險附約.pdf 中。\\n- 本人或其配偶之四親等以內之血親患有礙優生之遺傳性疾病: 僅出現在台灣人壽新住院醫療保險附約.pdf 中。'}"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def prepare_string(data):\n",
    "    nodes_str = \"Nodes are:\\n\"\n",
    "    for node in data['nodes']:\n",
    "        node_id = node['id']\n",
    "        node_type = node['type']\n",
    "        if 'description' in node and node['description']:\n",
    "            node_description = f\", description: {node['description']}\"\n",
    "        else:\n",
    "            node_description = \"\"\n",
    "        nodes_str += f\"id: {node_id}, type: {node_type}{node_description}, source: {node['source']},\\n\"\n",
    "\n",
    "    rels_str = \"Relationships are:\\n\"\n",
    "    for rel in data['rels']:\n",
    "        start = rel['start']\n",
    "        end = rel['end']\n",
    "        rel_type = rel['type']\n",
    "        if 'description' in rel and rel['description']:\n",
    "            description = f\", description: {rel['description']}\"\n",
    "        else:\n",
    "            description = \"\"\n",
    "        rels_str += f\"({start})-[:{rel_type}]->({end}){description}\\n\"\n",
    "\n",
    "    return nodes_str + \"\\n\" + rels_str\n",
    "\n",
    "def process_community(community):\n",
    "    stringify_info = prepare_string(community)\n",
    "    summary = community_chain.invoke({'community_info': stringify_info})\n",
    "    return {\"community\": community['communityId'], \"summary\": summary}\n",
    "\n",
    "process_community(community_info[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Processing communities: 100%|██████████| 77/77 [00:52<00:00,  1.48it/s]\n"
     ]
    }
   ],
   "source": [
    "from concurrent.futures import ThreadPoolExecutor, as_completed\n",
    "from tqdm import tqdm\n",
    "\n",
    "def process_community_with_llm(community_info, max_retry=0):\n",
    "    '''\n",
    "    params:\n",
    "        community_info: [ { \n",
    "                            'communityId': str, 'nodes': [{'id': str, 'description': str|None, 'type': str}, ...], \n",
    "                            'rels': [{'start': str, 'description': str|None, 'type': str, 'end': 'str}, ...]\n",
    "                          },\n",
    "                          ... ]\n",
    "        max_retry: 最多嘗試次數, 假設為2, 則最多遞迴執行 2+1=3次\n",
    "    '''\n",
    "    summaries = []\n",
    "    faild_communities = []\n",
    "    with ThreadPoolExecutor(max_workers=5) as executor:\n",
    "        futures = {executor.submit(process_community, community): community for community in community_info}\n",
    "\n",
    "        for future in tqdm(as_completed(futures), total=len(futures), desc=\"Processing communities\"):\n",
    "            try:\n",
    "                summaries.append(future.result())\n",
    "            except Exception as e:\n",
    "                community = futures[future]\n",
    "                print(f'process community faild!:{community}, error:\\n{e}')\n",
    "                faild_communities.append(community)\n",
    "    if len(faild_communities) > 0 and max_retry > 0:\n",
    "        summaries.extend(process_community_with_llm(faild_communities, max_retry=max_retry-1))\n",
    "    return summaries\n",
    "summaries = process_community_with_llm(community_info, max_retry=0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'community': '2-168',\n",
       "  'summary': '在台灣人壽的住院醫療保險附約中，主要涉及被保險人的各種情況和行為。被保險人可能因同一疾病或傷害引起併發症，並在同一醫院接受門診外科手術或附表二的特定處置。被保險人享有全民健康保險，並在申請時不需要提供健康證明文件。保險涵蓋的年齡上限為八十五歲。被保險人可能經歷出院，並參與門診外科手術。保險條款中還提到被保險人可能因心臟病、不孕症、人工受孕、美容手術、非法施用毒品等多種原因接受治療或手術。此外，保險條款還包括對被保險人的通知，以確保其權益。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-272',\n",
       "  'summary': '在台灣人壽的住院醫療保險附約中，主要涉及被保險人的各種情況和行為。被保險人可能因同一疾病或傷害引起併發症，並在同一醫院接受門診外科手術或附表二的特定處置。被保險人享有全民健康保險，並在申請時不需要提供健康證明文件。保險涵蓋的年齡上限為八十五歲。被保險人可能經歷出院，並參與門診外科手術。保險條款中還提到被保險人可能因心臟病、不孕症、人工受孕、美容手術、非法施用毒品等多種原因接受治療或手術。此外，保險條款還包括對被保險人的通知，以確保其權益。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '1-1',\n",
       "  'summary': '《台灣人壽新住院醫療保險附約》與《台灣人壽龍實在住院醫療健康保險附約》詳細說明了保險契約的各項條款與規定。保險責任始於要保人交付第一期保險費後，並由本公司發給保險單作為承保憑證。要保人需履行告知義務，並在住址變更時通知本公司。附約效力會因主契約效力停止而同時停止，並且有寬限期間的規定。續保時需重新計算保險費，最高續保年齡為二十三歲。要保人有權在保險單送達後十日內撤銷附約，並可申請附約復效。保險事故發生後，本公司負有給付保險金的責任，但若要保人未繳清保險費，保險金將扣除欠繳部分。附約的終止與解除權利也有詳細規定。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-315',\n",
       "  'summary': '在台灣人壽的住院醫療保險附約中，涉及多個概念和權利，包括告知義務、附約解除、附約撤銷權、續保等。要保人在訂立附約時需據實告知相關事項，否則本公司有權解除附約。附約的解除權在特定條件下會消滅。要保人可以在保險單送達後十日內撤銷附約，撤銷後本公司需退還保險費。附約的效力與主契約相關，主契約終止時附約也會終止。續保時保險費會重新計算，但不得針對個別被保險人調整。被保險人或其配偶的續保年齡最高為八十五歲。本公司在保險契約停止效力後會通知要保人有申請復效的權利，並有權不予承保在拒保範圍內的被保險人。\\n\\n來源: \\n- 台灣人壽新住院醫療保險附約.pdf\\n- 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '1-4',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約及台灣人壽龍實在住院醫療健康保險附約中，主要涉及被保險人的各種情況和行為。被保險人可能因同一疾病或傷害引起併發症，並在同一醫院接受門診外科手術或附表二的特定處置。被保險人享有全民健康保險，但在某些情況下不需要提供健康證明文件。保險涵蓋的年齡上限為八十五歲。被保險人可能經歷出院、流產、分娩、剖腹產等事件，並可能面臨心臟病、心律不整、肺氣腫等健康問題。此外，保險不涵蓋因故意行為、犯罪行為、非法施用毒品等引起的情況。保險公司需通知被保險人以確保其權益。來源檔名包括《台灣人壽新住院醫療保險附約.pdf》和《台灣人壽龍實在住院醫療健康保險附約.pdf》。'},\n",
       " {'community': '0-286',\n",
       "  'summary': '在台灣人壽的住院醫療保險附約中，保險金與一次住院事件相關，並且保險金有一定的限額。\\n\\n來源檔名: \\n- 台灣人壽新住院醫療保險附約.pdf\\n- 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-252',\n",
       "  'summary': '保險期間是指自保險單上所載期間之始日午夜十二時起至終日午夜十二時止，並且包含主契約保險費。若契約另有約定，則從其約定。  \\n來源: 台灣人壽龍實在住院醫療健康保險附約.pdf, 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-313',\n",
       "  'summary': '第十六條描述了保險責任始期及交付保險費的相關規定。根據台灣人壽新住院醫療保險附約，保險責任的開始時間是從要保人交付第一期保險費時起算。若要保人行使撤銷權，撤銷效力自要保人意思表示到達翌日零時起生效，附約自始無效，本公司需退還已繳保險費且不負保險責任，但在撤銷生效前發生的保險事故仍需依附約規定負責。來源檔名: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '2-52',\n",
       "  'summary': '《台灣人壽新住院醫療保險附約》與《台灣人壽龍實在住院醫療健康保險附約》詳細說明了保險契約的各項條款與規定。保險責任自要保人交付第一期保險費後開始，並應發給保險單作為承保憑證。要保人需據實告知相關事項，否則本公司有權解除附約。附約效力會因主契約效力停止而同時停止，並且有寬限期間的規定。續保時需重新計算保險費，最高續保年齡為二十三歲。要保人可在保險單送達十日內撤銷附約，並可申請復效。保險事故發生後，本公司仍負保險責任，但若要保人未繳清保險費，保險金將扣除欠繳部分。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-16',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約中，第二十二條描述了附約效力的停止。  \\n來源: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-324',\n",
       "  'summary': '第二十一條描述了續保保險年齡的限制，這些規定可以在「台灣人壽龍實在住院醫療健康保險附約」和「台灣人壽新住院醫療保險附約」中找到。'},\n",
       " {'community': '2-179',\n",
       "  'summary': '台灣人壽新住院醫療保險附約(85)包含多項保險金給付，涵蓋住院病房費用保險金、住院醫療費用保險金、補充保險金、住院前後門診費用保險金、外科手術費用保險金、日額型住院醫療保險金及出院後門診腫瘤治療費用保險金。這些保險金的給付依據不同條款及附表一、附表二的限額規定。若醫療費用未經全民健康保險給付，則按實際支付費用的百分之六十五給付，但補充保險金不在此範圍內。日額型住院醫療保險金排除其他保險金的給付。住院病房費用保險金在特定情況下（如重大傷病、特別病房）可提高限額。出院後門診腫瘤治療費用保險金適用於放射線治療和化學治療。各項保險金的給付及限額均依據相關條款及附表規定。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '1-20',\n",
       "  'summary': '台灣人壽新住院醫療保險附約(85)包含多項保險金給付，涵蓋住院病房費用保險金、住院醫療費用保險金、補充保險金、住院前後門診費用保險金、外科手術費用保險金、日額型住院醫療保險金及出院後門診腫瘤治療費用保險金。這些保險金的給付依據不同條款及附表一、附表二的限額規定。若醫療費用未經全民健康保險給付，則按實際支付費用的百分之六十五給付，但補充保險金不在此範圍內。日額型住院醫療保險金排除其他多項保險金的給付。出院後門診腫瘤治療費用保險金適用於放射線治療及化學治療。住院病房費用保險金在特定情況下（如重大傷病、特別病房）可提高限額。各項保險金的詳細規定及限額依據附表一、附表二及相關條款。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-360',\n",
       "  'summary': '台灣人壽新住院醫療保險附約(85)包含多項保險金給付項目，包括出院後門診腫瘤治療費用保險金、補充保險金、住院前後門診費用保險金、外科手術費用保險金及日額型住院醫療保險金。出院後門診腫瘤治療費用保險金給付放射線治療及化學治療，並依據第七條。醫療費用未經全民健康保險給付者之處理方式涵蓋外科手術費用保險金、補充保險金、住院前後門診費用保險金及出院後門診腫瘤治療費用保險金，依被保險人實際支付之各項費用的百分之六十五給付，但補充保險金不給付。日額型住院醫療保險金排除補充保險金、外科手術費用保險金、出院後門診腫瘤治療費用保險金及住院前後門診費用保險金。外科手術費用保險金的計算依附表二，限額依附表一。住院前後門診費用保險金依據第三條，限額依附表一，並排除第六條及第七條。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-369',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約中，主契約被保險人的子女的最高續保年齡為二十三歲。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-323',\n",
       "  'summary': '在台灣人壽的保險附約中，若要保人未能依約定交付第二期以後的分期保險費，保險公司會進行催告，自催告到達翌日起三十日內為寬限期間。在寬限期間內，若被保險人發生保險事故，保險公司仍負保險責任，但會從應給付的保險金中扣除欠繳的保險費。若逾寬限期間仍未交付保險費，附約效力將自寬限期間終了翌日起停止。寬限期間的規定適用於年繳或半年繳的保險費，月繳或季繳者則不另行催告，自保險單所載交付日期翌日起三十日為寬限期間。\\n\\n來源: \\n- 台灣人壽新住院醫療保險附約.pdf\\n- 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-42',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約中，顱腔作為手術部位，包含了多種手術項目，包括腦瘤手術、顱骨切除術、腦內血腫清除以及頭顱穿洞術（止血引流、穿刺檢查）。這些手術項目均與顱腔相關，並在該保險附約中有所提及。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '1-126',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約中，顱腔作為手術部位，包含了多種手術項目，包括腦瘤手術、顱骨切除術、腦內血腫清除以及頭顱穿洞術（止血引流、穿刺檢查）。這些手術項目均涉及顱腔的治療和操作。來源檔名為《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '0-351',\n",
       "  'summary': '在台灣人壽的住院醫療保險附約中，受益人申領保險金時需要提供多種文件，包括醫療診斷書或住院證明、保險單或其謄本、醫療費用收據、受益人的身分證明以及保險金申請書。這些文件的詳細要求和規定在《台灣人壽龍實在住院醫療健康保險附約.pdf》和《台灣人壽新住院醫療保險附約.pdf》中有詳細說明。受益人為被保險人本人，若被保險人身故，則由其法定繼承人繼承保險金。醫療診斷書或住院證明不得由被保險人本人出具，若為電子文件，必要時需提供紙本文件。'},\n",
       " {'community': '2-144',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約中，顱腔作為手術部位，包含了多種手術項目，包括腦瘤手術、顱骨切除術、腦內血腫清除以及頭顱穿洞術（止血引流、穿刺檢查）。這些手術項目均涉及顱腔的治療和操作。來源檔名為《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '2-203',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約和台灣人壽龍實在住院醫療健康保險附約中，保險金的申領需要提供多種文件，包括醫療診斷書或住院證明、保險單或其謄本、醫療費用收據、受益人的身分證明和保險金申請書。醫師需領有證書與執業執照，並合法執業，才能出具醫療診斷書或住院證明，但要保人或被保險人為醫師時，不得為被保險人出具診斷書或住院證明。腫瘤相關手術包括惡性瘤之外科切除、其他一個或多個良性瘤、腔鞘囊腫和粘腋膜、皮膚和皮下組織之惡性瘤，這些手術的保險給付比例分別為20%、5%、2%和10%。受益人為被保險人本人，若被保險人身故，則由法定繼承人繼承保險金。'},\n",
       " {'community': '0-93',\n",
       "  'summary': '計劃二和計劃四是兩種不同的保險計劃，分別包含不同的保險金限額。計劃二包含每日住院病房費用保險金限額（1,000或1,500）、外科手術費用保險金限額（160,000或180,000）以及住院前後門診費用保險金限額（600或900）。計劃四則包含每日住院病房費用保險金限額（2,500）、外科手術費用保險金限額（220,000）以及住院前後門診費用保險金限額（1,500）。這些資訊均來自於「台灣人壽新住院醫療保險附約.pdf」和「台灣人壽龍實在住院醫療健康保險附約.pdf」。'},\n",
       " {'community': '1-29',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約和台灣人壽龍實在住院醫療健康保險附約中，保險金的申領需要提供多種文件，包括醫療診斷書或住院證明、保險單或其謄本、醫療費用收據、受益人的身分證明和保險金申請書。醫師需領有證書與執業執照，且合法執業，才能出具醫療診斷書或住院證明，但要保人或被保險人為醫師時，不得為被保險人出具診斷書或住院證明。腫瘤相關手術包括惡性瘤之外科切除、其他一個或多個良性瘤、腔鞘囊腫和粘腋膜、皮膚和皮下組織之惡性瘤，這些手術的保險給付比例分別為20%、5%、2%和10%。受益人為被保險人本人，若被保險人身故，則由法定繼承人繼承保險金。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-134',\n",
       "  'summary': '內分泌系統是一個手術項目類別，包含了甲狀腺囊腫或甲狀腺舌囊切除、甲狀腺全部切除術和副甲狀腺切除術等手術項目。這些手術項目的給付比例資訊來自於《台灣人壽新住院醫療保險附約.pdf》。此外，內分泌系統本身也屬於手術項目類別的一部分。\\n\\n來源檔名: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '1-276',\n",
       "  'summary': '內分泌系統是一個手術項目類別，包含了甲狀腺囊腫或甲狀腺舌囊切除、甲狀腺全部切除術和副甲狀腺切除術這三種手術。這些資訊均來自於《台灣人壽新住院醫療保險附約.pdf》。此外，內分泌系統本身也屬於手術項目這一更大的類別。'},\n",
       " {'community': '0-348',\n",
       "  'summary': '在台灣人壽的住院醫療保險附約中，提供了不同的保險計劃和保險金限額。計劃一和計劃三是兩個主要的保險計劃。\\n\\n計劃一包含以下保險金限額：\\n- 住院醫療費用保險金限額：90,000元或120,000元\\n- 出院後門診腫瘤治療費用保險金限額：40,000元或60,000元\\n- 補充保險金限額：2,000元或3,000元\\n\\n計劃三則提供更高的保險金限額，具體如下：\\n- 住院醫療費用保險金限額：150,000元\\n- 出院後門診腫瘤治療費用保險金限額：80,000元\\n- 補充保險金限額：4,000元\\n此外，計劃三還包括住院日額保險金3,000元/日，門診手術或特定處置費用保險金限額30,000元，住院前後門診保險金1,000元/次，每年保險金給付總限額1,500,000元。\\n\\n來源檔名：\\n- 台灣人壽新住院醫療保險附約.pdf\\n- 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '2-94',\n",
       "  'summary': '內分泌系統是一個手術項目類別，包含了甲狀腺囊腫或甲狀腺舌囊切除、甲狀腺全部切除術和副甲狀腺切除術等手術項目。這些資訊均來自於《台灣人壽新住院醫療保險附約.pdf》。此外，內分泌系統本身也屬於手術項目類別的一部分。'},\n",
       " {'community': '0-177',\n",
       "  'summary': '放射線治療項目包含多種治療方式，並且有不同的給付比例。具體包括照射治療規劃及劑量（每次，給付比例7%）、鈷六十照射（每次，給付比例3%）、直線加速器照射治療（每次，給付比例5%）以及初步或定位照相（每張，給付比例2%）。這些資訊均來自《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '1-275',\n",
       "  'summary': '放射線治療項目包含多種治療方式，並且每種治療方式有不同的給付比例。具體來說，照射治療規劃及劑量每次給付比例為7%，鈷六十照射每次給付比例為3%，直線加速器照射治療每次給付比例為5%，初步或定位照相每張給付比例為2%。這些資訊均來自於「台灣人壽新住院醫療保險附約.pdf」。'},\n",
       " {'community': '1-34',\n",
       "  'summary': '台灣人壽提供多種住院醫療保險計劃，包含計劃一、計劃二、計劃三和計劃四。每個計劃包含不同的保險金限額：\\n\\n- 計劃一包含每日住院病房費用保險金限額、住院醫療費用保險金限額、外科手術費用保險金限額、出院後門診腫瘤治療費用保險金限額、住院前後門診費用保險金限額和補充保險金限額。\\n- 計劃二包含每日住院病房費用保險金限額、住院醫療費用保險金限額、外科手術費用保險金限額、出院後門診腫瘤治療費用保險金限額、住院前後門診費用保險金限額和補充保險金限額。\\n- 計劃三包含每日住院病房費用保險金限額（2,000元）、住院醫療費用保險金限額（150,000元）、外科手術費用保險金限額（200,000元）、出院後門診腫瘤治療費用保險金限額（80,000元）、住院前後門診費用保險金限額（1,200元）和補充保險金限額（4,000元）。\\n- 計劃四包含每日住院病房費用保險金限額（2,500元）、住院醫療費用保險金限額（180,000元）、外科手術費用保險金限額（220,000元）、出院後門診腫瘤治療費用保險金限額（100,000元）、住院前後門診費用保險金限額（1,500元）和補充保險金限額（5,000元）。\\n\\n來源檔名：台灣人壽新住院醫療保險附約.pdf、台灣人壽龍實在住院醫療健康保險附約.pdf。'},\n",
       " {'community': '2-151',\n",
       "  'summary': '台灣人壽提供多種住院醫療保險計劃，包含計劃一、計劃二、計劃三和計劃四。每個計劃包含不同的保險金限額：\\n\\n- 計劃一包含每日住院病房費用保險金限額、住院醫療費用保險金限額、外科手術費用保險金限額、出院後門診腫瘤治療費用保險金限額、住院前後門診費用保險金限額和補充保險金限額。\\n- 計劃二包含每日住院病房費用保險金限額、住院醫療費用保險金限額、外科手術費用保險金限額、出院後門診腫瘤治療費用保險金限額、住院前後門診費用保險金限額和補充保險金限額。\\n- 計劃三包含每日住院病房費用保險金限額（2,000元）、住院醫療費用保險金限額（150,000元）、外科手術費用保險金限額（200,000元）、出院後門診腫瘤治療費用保險金限額（80,000元）、住院前後門診費用保險金限額（1,200元）和補充保險金限額（4,000元）。\\n- 計劃四包含每日住院病房費用保險金限額（2,500元）、住院醫療費用保險金限額（180,000元）、外科手術費用保險金限額（220,000元）、出院後門診腫瘤治療費用保險金限額（100,000元）、住院前後門診費用保險金限額（1,500元）和補充保險金限額（5,000元）。\\n\\n來源檔名：台灣人壽新住院醫療保險附約.pdf、台灣人壽龍實在住院醫療健康保險附約.pdf。'},\n",
       " {'community': '0-186',\n",
       "  'summary': '關節韌帶相關手術及其百分比包括以下幾種手術：\\n1. 切開肩骨、脊椎關節做關節固定、截除或形成術，佔25%。\\n2. 半月軟骨部份切除術，佔30%。\\n3. 人工關節移除術，佔22%。\\n4. 腱、韌帶皮下斷裂縫合術，佔16%。\\n5. 疾病脫臼或病狀而行之關節切除術，佔4%。\\n6. 人工髖關節或全膝關節再置術，佔94%。\\n\\n來源檔名: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '2-93',\n",
       "  'summary': '放射線治療項目包括多種治療方式，並且每種治療方式有不同的給付比例。具體來說，照射治療規劃及劑量每次給付比例為7%，鈷六十照射每次給付比例為3%，直線加速器照射治療每次給付比例為5%，初步或定位照相每張給付比例為2%。這些資訊均來自於「台灣人壽新住院醫療保險附約.pdf」。'},\n",
       " {'community': '0-195',\n",
       "  'summary': '顯微再接手術是一種醫療程序，包含一手指再接手術（描述為57%）、二手指以上再接手術（描述為100%）以及手、足斷肢再接術（描述為100%）。這些資訊來源於《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '2-229',\n",
       "  'summary': '關節韌帶相關手術及其百分比包括以下幾種手術：\\n1. 切開肩骨、脊椎關節做關節固定、截除或形成術，佔25%。\\n2. 半月軟骨部份切除術，佔30%。\\n3. 人工關節移除術，佔22%。\\n4. 腱、韌帶皮下斷裂縫合術，佔16%。\\n5. 疾病脫臼或病狀而行之關節切除術，佔4%。\\n6. 人工髖關節或全膝關節再置術，佔94%。\\n\\n來源檔名: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '1-225',\n",
       "  'summary': '顯微再接手術是一種醫療程序，包含一手指再接手術（57%）、二手指以上再接手術（100%）以及手、足斷肢再接術（100%）。這些資訊來源於《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '1-223',\n",
       "  'summary': '關節韌帶相關手術及其百分比包括以下幾種手術：\\n1. 切開肩骨、脊椎關節做關節固定、截除或形成術，佔25%。\\n2. 半月軟骨部份切除術，佔30%。\\n3. 人工關節移除術，佔22%。\\n4. 腱、韌帶皮下斷裂縫合術，佔16%。\\n5. 疾病脫臼或病狀而行之關節切除術，佔4%。\\n6. 人工髖關節或全膝關節再置術，佔94%。\\n\\n來源檔名: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-370',\n",
       "  'summary': '在台灣人壽的住院醫療保險附約中，腫瘤相關的手術及其百分比被詳細列出，包括惡性瘤之外科切除（20%）、腔鞘囊腫（2%）、粘腋膜、皮膚和皮下組織之惡性瘤（10%）以及其他一個或多個良性瘤（5%）。這些手術均屬於腫瘤的範疇，並且需要由領有醫師證書與執業執照的合法執業醫師進行診斷。\\n\\n來源: \\n- 台灣人壽新住院醫療保險附約.pdf\\n- 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '2-240',\n",
       "  'summary': '顯微再接手術是一種醫療程序，包含一手指再接手術（描述為57%）、二手指以上再接手術（描述為100%）以及手、足斷肢再接術（描述為100%）。這些資訊來源於《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '0-199',\n",
       "  'summary': '妊娠併發症是一種健康狀況，包含多種相關的醫療程序。這些程序包括葡萄胎除去術（6%）、子宮外孕手術（10%）、妊娠併發症所致之必要性剖腹產術（含死胎）（10%）、妊娠第一期流產（妊娠未滿13週）（2%）以及妊娠第二期流產（妊娠13週以上）（3%）。這些資訊均來自於《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '1-226',\n",
       "  'summary': '妊娠併發症是一種健康狀況，包含多種醫療程序。這些程序包括葡萄胎除去術（6%）、子宮外孕手術（10%）、妊娠併發症所致之必要性剖腹產術（含死胎）（10%）、妊娠第一期流產（妊娠未滿13週）（2%）以及妊娠第二期流產（妊娠13週以上）（3%）。這些資訊均來自《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '2-241',\n",
       "  'summary': '妊娠併發症是一種健康狀況，包含多種醫療程序。這些程序包括葡萄胎除去術（6%）、子宮外孕手術（10%）、妊娠併發症所致之必要性剖腹產術（含死胎）（10%）、妊娠第一期流產（妊娠未滿13週）（2%）以及妊娠第二期流產（妊娠13週以上）（3%）。這些資訊均來自《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '0-206',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約中，骨折是一種需要經開刀校正手術的病症，影響多個身體部位。以下是各部位受骨折影響的比例：\\n\\n- 脛骨和腓骨：37%\\n- 跗骨、腕骨、掌骨、蹠骨、鎖骨：14%\\n- 脊椎骨：48%\\n- 髖骨：29%\\n- 顴骨：18%\\n- 尺骨或撓骨：20%\\n- 骨盆骨：39%\\n- 顎骨：15%\\n- 膝蓋骨：16%\\n- 肋骨和指骨或趾骨：9%\\n- 鼻骨：6%\\n- 肩胛骨和肱骨：17%\\n- 股骨：40%\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '1-210',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約中，骨折是一種需要經開刀校正手術的病症，影響多個身體部位。以下是各部位受骨折影響的百分比：\\n\\n- 脛骨和腓骨：37%\\n- 跗骨、腕骨、掌骨、蹠骨、鎖骨：14%\\n- 脊椎骨：48%\\n- 髖骨：29%\\n- 顴骨：18%\\n- 尺骨或撓骨：20%\\n- 骨盆骨：39%\\n- 顎骨：15%\\n- 膝蓋骨：16%\\n- 肋骨和指骨或趾骨：9%\\n- 鼻骨：6%\\n- 肩胛骨和肱骨：17%\\n- 股骨：40%\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-227',\n",
       "  'summary': '截肢術是一種醫療狀況，會影響多個身體部位。根據《台灣人壽新住院醫療保險附約》，截肢術影響的部位及其描述比例如下：踝關節、腕關節、前臂、上臂和小腿各佔13%；手指和足趾各佔9%；股關節和大腿各佔20%。'},\n",
       " {'community': '1-211',\n",
       "  'summary': '截肢術是一種醫療狀況，會影響多個身體部位。根據《台灣人壽新住院醫療保險附約》中的資料，截肢術對不同部位的影響比例如下：股關節和大腿各占20%，踝關節、腕關節、前臂、上臂和小腿各占13%，手指和足趾各占9%。'},\n",
       " {'community': '2-217',\n",
       "  'summary': '截肢術是一種醫療狀況，會影響多個身體部位。根據《台灣人壽新住院醫療保險附約》中的資料，截肢術對不同部位的影響比例如下：股關節和大腿各占20%，踝關節、腕關節、前臂、上臂和小腿各占13%，手指和足趾各占9%。'},\n",
       " {'community': '0-325',\n",
       "  'summary': '第十四條條款描述了保險金給付之限制，指出被保險人已獲得全民健康保險給付的部分，本公司不予給付保險金。保險金給付之限制進一步限制了已獲得全民健康保險給付之部分。來源檔名為《台灣人壽新住院醫療保險附約.pdf》和《台灣人壽龍實在住院醫療健康保險附約.pdf》。'},\n",
       " {'community': '1-12',\n",
       "  'summary': '第十四條描述了保險金給付之限制，指出被保險人已獲得全民健康保險給付的部分，本公司不予給付保險金。這些限制包括已獲得全民健康保險給付之部分、已獲得其他住院醫療費用保險以實支實付給付者，以及每年保險金給付總限額。特別地，非以醫療費用收據正本、依其他法令投保或主管機關另有規定而獲得住院醫療費用之實支實付給付者不在此限。此外，若被保險人同一次住院之出院日期已跨越保單週年日，且入院日當年可申領之金額合計本次可申領住院保險金已超出「每年保險金給付總限額」者，超出部分得列入次年總限額計算。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '2-210',\n",
       "  'summary': '第十四條描述了保險金給付之限制，指出被保險人已獲得全民健康保險給付的部分，本公司不予給付保險金。這些限制包括已獲得全民健康保險給付之部分、已獲得其他住院醫療費用保險以實支實付給付者，以及每年保險金給付總限額。特別地，非以醫療費用收據正本、依其他法令投保或主管機關另有規定而獲得住院醫療費用之實支實付給付者不在此限。此外，若被保險人同一次住院之出院日期已跨越保單週年日，且入院日當年可申領之金額合計本次可申領住院保險金已超出「每年保險金給付總限額」者，超出部分得列入次年總限額計算。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf, 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-365',\n",
       "  'summary': '台灣人壽龍實在住院醫療健康保險附約和新住院醫療保險附約均為附加於主保險契約的保險附約。這些附約的構成部分包括保險單條款、要保書、批註和其他約定書。批註是指附約內容的變更或記載事項的增刪，需經要保人與保險公司雙方同意。新住院醫療保險附約還包括條款和契約當事人的解釋。這些文件和概念共同構成了保險附約的完整內容。\\n\\n來源: \\n- 台灣人壽龍實在住院醫療健康保險附約.pdf\\n- 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '1-26',\n",
       "  'summary': '台灣人壽龍實在住院醫療健康保險附約是一種附加於主保險契約的保險附約，需經要保人申請並由台灣人壽保險股份有限公司同意。該附約包含門診手術費用保險金和特定處置費用保險金，兩者在給付條件符合時僅擇一給付。門診手術費用保險金的每次最高給付金額不得超過附表一所載，且同一保單年度內最高給付次數為6次。附約的構成部分包括保險單條款、要保書、批註和其他約定書。台灣人壽保險股份有限公司提供免費申訴電話0800-213-269以供客戶使用。\\n\\n來源: 台灣人壽龍實在住院醫療健康保險附約.pdf, 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-364',\n",
       "  'summary': \"台灣人壽保險股份有限公司（以下簡稱「本公司」）提供免費申訴電話0800-213-269，供客戶使用。  \\n來源: ['台灣人壽龍實在住院醫療健康保險附約.pdf', '台灣人壽新住院醫療保險附約.pdf']\"},\n",
       " {'community': '0-263',\n",
       "  'summary': '本公司在同意承保並收取第一期保險費後，開始負保險責任，並發給保險單作為承保的憑證。如果在同意承保前預收相當於第一期保險費的金額，保險責任將從預收金額時開始計算。  \\n來源: 台灣人壽龍實在住院醫療健康保險附約.pdf, 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-310',\n",
       "  'summary': '在台灣人壽龍實在住院醫療健康保險附約中，若被保險人在有效期間內因第五條之約定住院診療，本公司將按實際住院日數依附表一所載投保計劃的「住院日額保險金」每日給付金額給付保險金。若被保險人在同一次住院期間曾住進加護病房或燒燙傷病房治療，其「住院日額保險金」每日給付金額將提高為2倍。同一次住院的「住院日額保險金」合計給付實際住院日數最高以365日為限。\\n\\n來源: 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-297',\n",
       "  'summary': '住院醫療費用保險金涵蓋多項費用，包括醫師診查費及會診費、藥品（在醫院使用之藥品、注射藥液及注射技術費）、非緊急傷病必要之輸血、掛號費及證明文件、來往醫院之救護車費，以及超過全民健康保險給付之住院醫療費用。這些費用的詳細資訊可參考來源文件《台灣人壽龍實在住院醫療健康保險附約.pdf》和《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '1-44',\n",
       "  'summary': '在「台灣人壽龍實在住院醫療健康保險附約」中，住院日額保險金的給付有以下幾點重要規定：\\n\\n1. 被保險人因精神疾病住院診療時，每一保單年度內的住院日額保險金給付日數最高為30日。\\n2. 被保險人同一次住院的住院日額保險金給付日數最高為365日。\\n3. 若被保險人在同一次住院期間曾住進加護病房或燒燙傷病房，其住院日額保險金每日給付金額在入住加護病房或燒燙傷病房期間提高為2倍。\\n\\n來源: 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '2-180',\n",
       "  'summary': '台灣人壽龍實在住院醫療健康保險附約是一種附加於主保險契約的保險附約，包含門診手術費用保險金、住院日額保險金和特定處置費用保險金等。該附約的構成部分包括批註、保險單條款、要保書和其他約定書。台灣人壽保險股份有限公司提供此保險附約及免費申訴電話（0800-213-269）。住院日額保險金在特定情況下（如入住加護病房或燒燙傷病房）每日給付金額可提高至2倍，並對精神疾病住院診療有每年30日的限制。同時，門診手術費用保險金和特定處置費用保險金只能擇一給付，且每次最高給付金額不得超過附表一所載。新住院醫療保險附約也依主保險契約的要保人申請並經公司同意附加，並包含批註、條款、要保書和其他約定書。\\n\\n來源: \\n- 台灣人壽龍實在住院醫療健康保險附約.pdf\\n- 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-292',\n",
       "  'summary': '「住院前後門診保險金」是指被保險人在住院診療或接受門診手術前七日內及出院後或接受門診手術後十四日內，因同一事故門診治療時，每次可依投保計劃獲得的保險金。同一日的最高給付次數為一次。此保險金的給付條件包括住院診療和門診治療，並依據第五條的規定。來源檔名為《台灣人壽龍實在住院醫療健康保險附約.pdf》。'},\n",
       " {'community': '0-289',\n",
       "  'summary': '「門診手術費用保險金」與「特定處置費用保險金」在全民健康保險醫療服務給付項目及支付標準變更的情況下，若被保險人同時符合兩者的給付條件，本公司僅擇一給付。此外，「門診手術費用保險金」每次最高給付金額不得超過附表一所載，且同一保單年度內最高給付次數以6次為限。\\n\\n來源: 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '1-50',\n",
       "  'summary': '在台灣人壽的住院醫療健康保險附約中，若被保險人因疾病或意外傷害事故需要住院診療或接受門診外科手術治療，則在住院前七日內及出院後十四日內，因同一事故進行門診治療時，可獲得「住院前後門診保險金」。同一日的「住院前後門診保險金」最高給付次數為一次。這些規定依據附約中的第五條進行定義。\\n\\n來源: \\n- 台灣人壽龍實在住院醫療健康保險附約.pdf\\n- 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '2-216',\n",
       "  'summary': '在台灣人壽新住院醫療保險附約中，骨折是一種需要經開刀校正手術的病症，影響多個身體部位。以下是各部位受骨折影響的比例：\\n\\n- 脛骨和腓骨：37%\\n- 跗骨、腕骨、掌骨、蹠骨、鎖骨：14%\\n- 脊椎骨：48%\\n- 髖骨：29%\\n- 顴骨：18%\\n- 尺骨或撓骨：20%\\n- 骨盆骨：39%\\n- 顎骨：15%\\n- 膝蓋骨：16%\\n- 肋骨和指骨或趾骨：9%\\n- 鼻骨：6%\\n- 肩胛骨和肱骨：17%\\n- 股骨：40%\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-374',\n",
       "  'summary': '門診外科手術治療是因疾病或傷害而進行的治療。疾病是指被保險人自本附約生效日（或復效日）起所發生的疾病，而傷害是指被保險人在本附約有效期間內遭受意外傷害事故而蒙受的傷害。這些資訊來自於《台灣人壽龍實在住院醫療健康保險附約.pdf》和《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '0-295',\n",
       "  'summary': '第十一條與第九條是來自《台灣人壽龍實在住院醫療健康保險附約.pdf》的條款，且第十一條與第九條之間存在關聯。'},\n",
       " {'community': '0-279',\n",
       "  'summary': '住院是指被保險人經醫師診斷其疾病或傷害必須入住醫院，且正式辦理住院手續並確實在醫院接受診療者，但不包含全民健康保險法第五十一條所稱之日間住院及精神衛生法第三十五條所稱之日間留院。醫院則是依照醫療法規定領有開業執照並設有病房收治病人之公、私立及醫療法人醫院。住院必須在醫院進行。來源檔名: 台灣人壽龍實在住院醫療健康保險附約.pdf, 台灣人壽新住院醫療保險附約.pdf。'},\n",
       " {'community': '0-306',\n",
       "  'summary': '第十二條規定了被保險人在附約有效期間內，因同一疾病或傷害及其併發症，在出院或接受門診手術後十四日內再次住院或接受門診手術時，保險金的給付及限額視為一次住院處理。如果被保險人在附約有效期間屆滿後出院，則再次住院部分不予給付保險金。此條款的詳細內容可參考《台灣人壽龍實在住院醫療健康保險附約.pdf》和《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '2-181',\n",
       "  'summary': '第十二條規定了被保險人在附約有效期間內，因同一疾病或傷害及其併發症，在出院或接受門診外科手術後十四日內再次住院或接受門診外科手術時，保險金的給付及其限額視為一次住院處理。如果被保險人在附約有效期間屆滿後出院，則再次住院部分不予給付保險金。此條款的詳細內容和規定均來自於《台灣人壽龍實在住院醫療健康保險附約.pdf》和《台灣人壽新住院醫療保險附約.pdf》。'},\n",
       " {'community': '1-45',\n",
       "  'summary': '第十二條規定了被保險人在附約有效期間內，因同一疾病或傷害及其併發症，在出院或接受門診手術後十四日內再次住院或接受門診手術時，保險金的給付及限額視為一次住院處理。如果被保險人在附約有效期間屆滿後出院，則再次住院部分不予給付保險金。此規定出現在「台灣人壽龍實在住院醫療健康保險附約.pdf」和「台灣人壽新住院醫療保險附約.pdf」中。'},\n",
       " {'community': '0-308',\n",
       "  'summary': '住院日數之計算是指被保險人依約定住院診療時，其住院日數的計算方式，包括入院及出院當日，即使在院時間不足一日，仍以一日計算。此規定在第十三條中詳細說明，並出現在「台灣人壽龍實在住院醫療健康保險附約」和「台灣人壽新住院醫療保險附約」中。'},\n",
       " {'community': '1-46',\n",
       "  'summary': '住院日數之計算是指被保險人依第三條或第五條之約定住院診療時，其住院日數的計算方式。無論入院或出院當日的在院時間是否不足一日，均以一日計算。此規定在「台灣人壽龍實在住院醫療健康保險附約」及「台灣人壽新住院醫療保險附約」中有詳細說明。'},\n",
       " {'community': '0-311',\n",
       "  'summary': '被保險人因精神疾病住院診療者，不論是否為同一疾病或同一次住院期間，每一保單年度「住院日額保險金」之合計給付實際住院日數，最高以30日為限。  \\n來源: 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-328',\n",
       "  'summary': '在台灣人壽龍實在住院醫療健康保險附約中，若已獲得其他住院醫療費用保險以實支實付給付者，則不需提供醫療費用收據正本。然而，若非以醫療費用收據正本、依其他法令投保或主管機關另有規定而獲得住院醫療費用之實支實付給付者則不在此限。\\n\\n來源: 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '2-182',\n",
       "  'summary': '住院日數之計算是指被保險人依第三條或第五條之約定住院診療時，其住院日數的計算方式。無論入院或出院當日的在院時間是否不足一日，均以一日計算。此規定在「台灣人壽龍實在住院醫療健康保險附約」及「台灣人壽新住院醫療保險附約」中有詳細說明。來源檔名為「台灣人壽龍實在住院醫療健康保險附約.pdf」及「台灣人壽新住院醫療保險附約.pdf」。'},\n",
       " {'community': '0-342',\n",
       "  'summary': '在台灣人壽的龍實在住院醫療健康保險附約中，保險費的計算會在續保時依據當時的費率及被保險人的保險年齡重新計算。如果要保人不同意重新計算後的保險費，保險效力將在保險期間屆滿後終止。年齡的計算及錯誤的處理規定了被保險人的投保年齡計算方式及錯誤處理方法，包括真實投保年齡超過最高年齡時保險無效、溢繳保險費退還、短繳保險費補繳或減少保險金限額等情況。第二十三條涉及保險費的計算，並引用了民法第二百零三條的法定週年利率計算利息。\\n\\n來源: 台灣人壽龍實在住院醫療健康保險附約.pdf, 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '0-330',\n",
       "  'summary': '「每年保險金給付總限額」是指被保險人在同一保單年內，根據第六條至第十條所能申請的各項保險金合計總額，最高以附表一所列的投保計劃別之「每年保險金給付總限額」為限。如果被保險人同一次住院的出院日期跨越保單週年日，且入院當年可申領的金額已超出「每年保險金給付總限額」，超出部分可以列入次年總限額計算。來源: 台灣人壽龍實在住院醫療健康保險附約.pdf'},\n",
       " {'community': '0-371',\n",
       "  'summary': '住院病房費用保險金是針對被保險人因全民健康保險規定住院診療時，需自行負擔及不屬全民健康保險給付範圍的費用進行核付。當被保險人因醫師診斷認定有危及生命的情形或因燒燙傷而必須住進特別病房，或符合全民健康保險主管機關公告的重大傷病範圍時，住院病房費用保險金的限額將提高。該保險金核付的費用包括超等住院的病房費差額、特別護士以外的護理費及管灌飲食以外的膳食費。\\n\\n來源: 台灣人壽新住院醫療保險附約.pdf'},\n",
       " {'community': '2-176',\n",
       "  'summary': '在台灣人壽的住院醫療健康保險附約中，若被保險人因疾病或意外傷害事故需要住院診療或接受門診外科手術治療，則在住院前七日內及出院後十四日內，因同一事故進行門診治療時，可獲得「住院前後門診保險金」。同一日的「住院前後門診保險金」最高給付次數為一次。此保險金的給付依據是根據附約中的第五條規定。\\n\\n來源: \\n- 台灣人壽龍實在住院醫療健康保險附約.pdf\\n- 台灣人壽新住院醫療保險附約.pdf'}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "summaries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "UNWIND $data AS row\n",
    "MERGE (c:__Community__ {id:row.community})\n",
    "SET c.summary = row.summary\n",
    "\"\"\", params={\"data\": summaries})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n.description': '1,000, 1,500'},\n",
       " {'n.description': '90,000, 120,000'},\n",
       " {'n.description': '160,000, 180,000'},\n",
       " {'n.description': '40,000, 60,000'},\n",
       " {'n.description': '600, 900'},\n",
       " {'n.description': '2,000, 3,000'},\n",
       " {'n.description': '50%, 32%'}]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query('''\n",
    "MATCH (n:__Entity__)\n",
    "WHERE n.description IS NOT NULL and apoc.meta.cypher.type(n.description) <> 'STRING'\n",
    "REMOVE n.embedding\n",
    "SET n.description = apoc.text.join(n.description, \"\\n---\\n\")\n",
    "RETURN n.description\n",
    "''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\n",
    "    \"\"\"\n",
    "MATCH (n:`__Community__`)<-[:IN_COMMUNITY]-()<-[:HAS_ENTITY]-(c)\n",
    "WITH n, count(distinct c) AS chunkCount\n",
    "SET n.weight = chunkCount\"\"\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "py312",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
