{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "os.environ[\"NEO4J_URI\"] = \"bolt://localhost:7687\"\n",
    "os.environ[\"NEO4J_USERNAME\"] = \"neo4j\"\n",
    "os.environ[\"NEO4J_PASSWORD\"] = \"2wsx3edc\"\n",
    "\n",
    "graph = Neo4jGraph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience \n",
    "\n",
    "gds = GraphDataScience( \n",
    "    os.environ[ \"NEO4J_URI\" ], \n",
    "    auth=(os.environ[ \"NEO4J_USERNAME\" ], os.environ[ \"NEO4J_PASSWORD\" ]) \n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "gds.graph.drop(\"communities\")\n",
    "G, result = gds.graph.project(\n",
    "    \"communities\",  #  Graph name\n",
    "    \"__Entity__\",  #  Node projection\n",
    "    {\n",
    "        \"_ALL_\": {\n",
    "            \"type\": \"*\",\n",
    "            \"orientation\": \"UNDIRECTED\",\n",
    "            \"properties\": {\"weight\": {\"property\": \"*\", \"aggregation\": \"COUNT\"}},\n",
    "        }\n",
    "    },\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Component count: 2\n",
      "Component distribution: {'min': 4, 'p5': 4, 'max': 26, 'p999': 26, 'p99': 26, 'p1': 4, 'p10': 4, 'p90': 26, 'p50': 4, 'p25': 4, 'p75': 26, 'p95': 26, 'mean': 15.0}\n"
     ]
    }
   ],
   "source": [
    "wcc = gds.wcc.stats(G)\n",
    "print(f\"Component count: {wcc['componentCount']}\")\n",
    "print(f\"Component distribution: {wcc['componentDistribution']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "writeMillis                                                             22\n",
       "nodePropertiesWritten                                                   30\n",
       "ranLevels                                                                2\n",
       "didConverge                                                           True\n",
       "nodeCount                                                               30\n",
       "communityCount                                                           5\n",
       "communityDistribution    {'min': 3, 'p5': 3, 'max': 12, 'p999': 12, 'p9...\n",
       "modularity                                                        0.543721\n",
       "modularities                     [0.48060486522024987, 0.5437212360289283]\n",
       "postProcessingMillis                                                     7\n",
       "preProcessingMillis                                                      0\n",
       "computeMillis                                                           30\n",
       "configuration            {'writeProperty': 'communities', 'theta': 0.01...\n",
       "Name: 0, dtype: object"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds.leiden.write(\n",
    "    G,\n",
    "    writeProperty=\"communities\",\n",
    "    includeIntermediateCommunities=True,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(*)': 60}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "MATCH (e:`__Entity__`)\n",
    "UNWIND range(0, size(e.communities) - 1 , 1) AS index\n",
    "CALL {\n",
    "  WITH e, index\n",
    "  WITH e, index\n",
    "  WHERE index = 0\n",
    "  MERGE (c:`__Community__` {id: toString(index) + '-' + toString(e.communities[index])})\n",
    "  ON CREATE SET c.level = index\n",
    "  MERGE (e)-[:IN_COMMUNITY]->(c)\n",
    "  RETURN count(*) AS count_0\n",
    "}\n",
    "CALL {\n",
    "  WITH e, index\n",
    "  WITH e, index\n",
    "  WHERE index > 0\n",
    "  MERGE (current:`__Community__` {id: toString(index) + '-' + toString(e.communities[index])})\n",
    "  ON CREATE SET current.level = index\n",
    "  MERGE (previous:`__Community__` {id: toString(index - 1) + '-' + toString(e.communities[index - 1])})\n",
    "  ON CREATE SET previous.level = index - 1\n",
    "  MERGE (previous)-[:IN_COMMUNITY]->(current)\n",
    "  RETURN count(*) AS count_1\n",
    "}\n",
    "RETURN count(*)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "MATCH (c:__Community__)<-[:IN_COMMUNITY*]-(:__Entity__)<-[:HAS_ENTITY]-(d:__Chunk__)\n",
    "WITH c, count(distinct d) AS rank\n",
    "SET c.rank = rank;\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Level</th>\n",
       "      <th>Number of communities</th>\n",
       "      <th>25th Percentile</th>\n",
       "      <th>50th Percentile</th>\n",
       "      <th>75th Percentile</th>\n",
       "      <th>90th Percentile</th>\n",
       "      <th>99th Percentile</th>\n",
       "      <th>Max</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>10</td>\n",
       "      <td>2.0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>3.75</td>\n",
       "      <td>4.1</td>\n",
       "      <td>4.91</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>4.0</td>\n",
       "      <td>5.0</td>\n",
       "      <td>6.00</td>\n",
       "      <td>9.6</td>\n",
       "      <td>11.76</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Level  Number of communities  25th Percentile  50th Percentile  \\\n",
       "0     0                     10              2.0              3.0   \n",
       "1     1                      5              4.0              5.0   \n",
       "\n",
       "   75th Percentile  90th Percentile  99th Percentile  Max  \n",
       "0             3.75              4.1             4.91    5  \n",
       "1             6.00              9.6            11.76   12  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "\n",
    "community_size = graph.query(\n",
    "    \"\"\"\n",
    "MATCH (c:__Community__)<-[:IN_COMMUNITY*]-(e:__Entity__)\n",
    "WITH c, count(distinct e) AS entities\n",
    "RETURN split(c.id, '-')[0] AS level, entities\n",
    "\"\"\"\n",
    ")\n",
    "community_size_df = pd.DataFrame.from_records(community_size)\n",
    "percentiles_data = []\n",
    "for level in community_size_df[\"level\"].unique():\n",
    "    subset = community_size_df[community_size_df[\"level\"] == level][\"entities\"]\n",
    "    num_communities = len(subset)\n",
    "    percentiles = np.percentile(subset, [25, 50, 75, 90, 99])\n",
    "    percentiles_data.append(\n",
    "        [\n",
    "            level,\n",
    "            num_communities,\n",
    "            percentiles[0],\n",
    "            percentiles[1],\n",
    "            percentiles[2],\n",
    "            percentiles[3],\n",
    "            percentiles[4],\n",
    "            max(subset)\n",
    "        ]\n",
    "    )\n",
    "\n",
    "# Create a DataFrame with the percentiles\n",
    "percentiles_df = pd.DataFrame(\n",
    "    percentiles_data,\n",
    "    columns=[\n",
    "        \"Level\",\n",
    "        \"Number of communities\",\n",
    "        \"25th Percentile\",\n",
    "        \"50th Percentile\",\n",
    "        \"75th Percentile\",\n",
    "        \"90th Percentile\",\n",
    "        \"99th Percentile\",\n",
    "        \"Max\"\n",
    "    ],\n",
    ")\n",
    "percentiles_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'communityId': '0-3',\n",
       "  'nodes': [{'id': 'Company', 'description': None, 'type': 'Organization'},\n",
       "   {'id': 'Policyholder', 'description': None, 'type': 'Person'},\n",
       "   {'id': 'Value-Added Feedback Bonus',\n",
       "    'description': None,\n",
       "    'type': 'Concept'},\n",
       "   {'id': 'Insured', 'description': None, 'type': 'Person'}],\n",
       "  'rels': [{'start': 'Company',\n",
       "    'description': None,\n",
       "    'type': 'REFUND_ACCUMULATED_AMOUNT',\n",
       "    'end': 'Insured'},\n",
       "   {'start': 'Company',\n",
       "    'description': None,\n",
       "    'type': 'NOTIFY_IN_WRITING',\n",
       "    'end': 'Policyholder'},\n",
       "   {'start': 'Company',\n",
       "    'description': None,\n",
       "    'type': 'REFUND_ACCUMULATED_AMOUNT',\n",
       "    'end': 'Policyholder'},\n",
       "   {'start': 'Value-Added Feedback Bonus',\n",
       "    'description': None,\n",
       "    'type': 'PURCHASE_ADDITIONAL_PAID-UP_INSURANCE',\n",
       "    'end': 'Policyholder'},\n",
       "   {'start': 'Value-Added Feedback Bonus',\n",
       "    'description': None,\n",
       "    'type': 'DEDUCT_PREMIUM',\n",
       "    'end': 'Policyholder'}]},\n",
       " {'communityId': '0-5',\n",
       "  'nodes': [{'id': '投保', 'description': None, 'type': 'Action'},\n",
       "   {'id': '台灣人壽', 'description': None, 'type': 'Organization'},\n",
       "   {'id': '美鑫美利美元利率變動型終身壽險',\n",
       "    'description': None,\n",
       "    'type': 'Insurance_product'}],\n",
       "  'rels': [{'start': '投保',\n",
       "    'description': None,\n",
       "    'type': 'TARGETS',\n",
       "    'end': '美鑫美利美元利率變動型終身壽險'},\n",
       "   {'start': '台灣人壽',\n",
       "    'description': None,\n",
       "    'type': 'PROVIDES',\n",
       "    'end': '美鑫美利美元利率變動型終身壽險'}]},\n",
       " {'communityId': '0-12',\n",
       "  'nodes': [{'id': '儲存生息', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '保單年度', 'description': None, 'type': 'Time_period'},\n",
       "   {'id': '各年度之增值回饋分享金', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '宣告利率', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '年複利方式', 'description': None, 'type': 'Concept'}],\n",
       "  'rels': [{'start': '儲存生息',\n",
       "    'description': None,\n",
       "    'type': '影響',\n",
       "    'end': '各年度之增值回饋分享金'},\n",
       "   {'start': '各年度之增值回饋分享金',\n",
       "    'description': None,\n",
       "    'type': 'RELATED_TO',\n",
       "    'end': '保單年度'},\n",
       "   {'start': '各年度之增值回饋分享金',\n",
       "    'description': None,\n",
       "    'type': '開始給付',\n",
       "    'end': '保單年度'},\n",
       "   {'start': '各年度之增值回饋分享金', 'description': None, 'type': '累積', 'end': '年複利方式'},\n",
       "   {'start': '各年度之增值回饋分享金',\n",
       "    'description': None,\n",
       "    'type': '按月計算',\n",
       "    'end': '宣告利率'}]},\n",
       " {'communityId': '0-10',\n",
       "  'nodes': [{'id': '保險年齡', 'description': None, 'type': 'Age'},\n",
       "   {'id': '被保險人', 'description': None, 'type': 'Person'}],\n",
       "  'rels': [{'start': '被保險人',\n",
       "    'description': None,\n",
       "    'type': 'HAS',\n",
       "    'end': '保險年齡'}]},\n",
       " {'communityId': '0-23',\n",
       "  'nodes': [{'id': '書面通知', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '保險金額', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '電子郵件通知', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '要保人', 'description': None, 'type': 'Person'}],\n",
       "  'rels': [{'start': '書面通知', 'description': None, 'type': '通知', 'end': '要保人'},\n",
       "   {'start': '要保人', 'description': None, 'type': '選擇', 'end': '保險金額'},\n",
       "   {'start': '電子郵件通知', 'description': None, 'type': '通知', 'end': '要保人'}]},\n",
       " {'communityId': '0-18',\n",
       "  'nodes': [{'id': '本契約終止', 'description': None, 'type': 'Event'},\n",
       "   {'id': '受益人', 'description': None, 'type': 'Person'},\n",
       "   {'id': '保險金', 'description': None, 'type': 'Concept'}],\n",
       "  'rels': [{'start': '本契約終止', 'description': None, 'type': '受領', 'end': '受益人'},\n",
       "   {'start': '受益人', 'description': None, 'type': '受領', 'end': '保險金'}]},\n",
       " {'communityId': '0-21',\n",
       "  'nodes': [{'id': '本公司', 'description': None, 'type': 'Organization'},\n",
       "   {'id': '身故保險金', 'description': None, 'type': 'Concept'}],\n",
       "  'rels': [{'start': '本公司',\n",
       "    'description': None,\n",
       "    'type': '給付',\n",
       "    'end': '身故保險金'}]},\n",
       " {'communityId': '0-25',\n",
       "  'nodes': [{'id': '未滿15足歲之未成年人', 'description': None, 'type': 'Person'},\n",
       "   {'id': '訂立本契約時', 'description': None, 'type': 'Event'},\n",
       "   {'id': '喪葬費用保險金', 'description': None, 'type': 'Concept'}],\n",
       "  'rels': [{'start': '未滿15足歲之未成年人',\n",
       "    'description': None,\n",
       "    'type': '變更為',\n",
       "    'end': '喪葬費用保險金'},\n",
       "   {'start': '未滿15足歲之未成年人',\n",
       "    'description': None,\n",
       "    'type': '給付',\n",
       "    'end': '喪葬費用保險金'},\n",
       "   {'start': '訂立本契約時',\n",
       "    'description': None,\n",
       "    'type': '以...為被保險人',\n",
       "    'end': '未滿15足歲之未成年人'}]},\n",
       " {'communityId': '0-27',\n",
       "  'nodes': [{'id': '被保險人滿15足歲之日起', 'description': None, 'type': 'Event'},\n",
       "   {'id': '死亡給付', 'description': None, 'type': 'Concept'}],\n",
       "  'rels': [{'start': '被保險人滿15足歲之日起',\n",
       "    'description': None,\n",
       "    'type': '約定發生效力',\n",
       "    'end': '死亡給付'}]},\n",
       " {'communityId': '0-29',\n",
       "  'nodes': [{'id': '保險契約', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '民國九十九年二月三日', 'description': None, 'type': 'Date'}],\n",
       "  'rels': [{'start': '民國九十九年二月三日',\n",
       "    'description': None,\n",
       "    'type': '訂立',\n",
       "    'end': '保險契約'}]},\n",
       " {'communityId': '1-1',\n",
       "  'nodes': [{'id': 'Company', 'description': None, 'type': 'Organization'},\n",
       "   {'id': 'Policyholder', 'description': None, 'type': 'Person'},\n",
       "   {'id': 'Value-Added Feedback Bonus',\n",
       "    'description': None,\n",
       "    'type': 'Concept'},\n",
       "   {'id': 'Insured', 'description': None, 'type': 'Person'}],\n",
       "  'rels': [{'start': 'Company',\n",
       "    'description': None,\n",
       "    'type': 'REFUND_ACCUMULATED_AMOUNT',\n",
       "    'end': 'Insured'},\n",
       "   {'start': 'Company',\n",
       "    'description': None,\n",
       "    'type': 'NOTIFY_IN_WRITING',\n",
       "    'end': 'Policyholder'},\n",
       "   {'start': 'Company',\n",
       "    'description': None,\n",
       "    'type': 'REFUND_ACCUMULATED_AMOUNT',\n",
       "    'end': 'Policyholder'},\n",
       "   {'start': 'Value-Added Feedback Bonus',\n",
       "    'description': None,\n",
       "    'type': 'PURCHASE_ADDITIONAL_PAID-UP_INSURANCE',\n",
       "    'end': 'Policyholder'},\n",
       "   {'start': 'Value-Added Feedback Bonus',\n",
       "    'description': None,\n",
       "    'type': 'DEDUCT_PREMIUM',\n",
       "    'end': 'Policyholder'}]},\n",
       " {'communityId': '1-3',\n",
       "  'nodes': [{'id': '儲存生息', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '保單年度', 'description': None, 'type': 'Time_period'},\n",
       "   {'id': '各年度之增值回饋分享金', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '宣告利率', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '年複利方式', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '投保', 'description': None, 'type': 'Action'},\n",
       "   {'id': '台灣人壽', 'description': None, 'type': 'Organization'},\n",
       "   {'id': '美鑫美利美元利率變動型終身壽險', 'description': None, 'type': 'Insurance_product'},\n",
       "   {'id': '書面通知', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '保險金額', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '電子郵件通知', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '要保人', 'description': None, 'type': 'Person'}],\n",
       "  'rels': [{'start': '儲存生息',\n",
       "    'description': None,\n",
       "    'type': '影響',\n",
       "    'end': '各年度之增值回饋分享金'},\n",
       "   {'start': '各年度之增值回饋分享金', 'description': None, 'type': '給付', 'end': '要保人'},\n",
       "   {'start': '各年度之增值回饋分享金',\n",
       "    'description': None,\n",
       "    'type': '通知',\n",
       "    'end': '電子郵件通知'},\n",
       "   {'start': '各年度之增值回饋分享金', 'description': None, 'type': '通知', 'end': '書面通知'},\n",
       "   {'start': '各年度之增值回饋分享金',\n",
       "    'description': None,\n",
       "    'type': 'RELATED_TO',\n",
       "    'end': '保單年度'},\n",
       "   {'start': '各年度之增值回饋分享金',\n",
       "    'description': None,\n",
       "    'type': '開始給付',\n",
       "    'end': '保單年度'},\n",
       "   {'start': '各年度之增值回饋分享金', 'description': None, 'type': '累積', 'end': '年複利方式'},\n",
       "   {'start': '各年度之增值回饋分享金',\n",
       "    'description': None,\n",
       "    'type': '按月計算',\n",
       "    'end': '宣告利率'},\n",
       "   {'start': '各年度之增值回饋分享金', 'description': None, 'type': '給付', 'end': '要保人'},\n",
       "   {'start': '美鑫美利美元利率變動型終身壽險',\n",
       "    'description': None,\n",
       "    'type': 'INCLUDES',\n",
       "    'end': '各年度之增值回饋分享金'},\n",
       "   {'start': '要保人', 'description': None, 'type': '選擇', 'end': '保險金額'},\n",
       "   {'start': '要保人', 'description': None, 'type': 'PERFORMS', 'end': '投保'},\n",
       "   {'start': '電子郵件通知', 'description': None, 'type': '通知', 'end': '要保人'},\n",
       "   {'start': '書面通知', 'description': None, 'type': '通知', 'end': '要保人'},\n",
       "   {'start': '台灣人壽',\n",
       "    'description': None,\n",
       "    'type': 'PROVIDES',\n",
       "    'end': '美鑫美利美元利率變動型終身壽險'},\n",
       "   {'start': '投保',\n",
       "    'description': None,\n",
       "    'type': 'TARGETS',\n",
       "    'end': '美鑫美利美元利率變動型終身壽險'}]},\n",
       " {'communityId': '1-9',\n",
       "  'nodes': [{'id': '保險年齡', 'description': None, 'type': 'Age'},\n",
       "   {'id': '被保險人', 'description': None, 'type': 'Person'},\n",
       "   {'id': '被保險人滿15足歲之日起', 'description': None, 'type': 'Event'},\n",
       "   {'id': '死亡給付', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '本公司', 'description': None, 'type': 'Organization'},\n",
       "   {'id': '身故保險金', 'description': None, 'type': 'Concept'}],\n",
       "  'rels': [{'start': '被保險人',\n",
       "    'description': None,\n",
       "    'type': '給付',\n",
       "    'end': '身故保險金'},\n",
       "   {'start': '被保險人', 'description': None, 'type': 'HAS', 'end': '保險年齡'},\n",
       "   {'start': '被保險人滿15足歲之日起',\n",
       "    'description': None,\n",
       "    'type': '約定發生效力',\n",
       "    'end': '死亡給付'},\n",
       "   {'start': '被保險人滿15足歲之日起',\n",
       "    'description': None,\n",
       "    'type': '起發生效力',\n",
       "    'end': '被保險人'},\n",
       "   {'start': '本公司', 'description': None, 'type': '給付', 'end': '身故保險金'}]},\n",
       " {'communityId': '1-4',\n",
       "  'nodes': [{'id': '本契約終止', 'description': None, 'type': 'Event'},\n",
       "   {'id': '受益人', 'description': None, 'type': 'Person'},\n",
       "   {'id': '保險金', 'description': None, 'type': 'Concept'}],\n",
       "  'rels': [{'start': '本契約終止', 'description': None, 'type': '受領', 'end': '受益人'},\n",
       "   {'start': '受益人', 'description': None, 'type': '受領', 'end': '保險金'}]},\n",
       " {'communityId': '1-8',\n",
       "  'nodes': [{'id': '未滿15足歲之未成年人', 'description': None, 'type': 'Person'},\n",
       "   {'id': '訂立本契約時', 'description': None, 'type': 'Event'},\n",
       "   {'id': '喪葬費用保險金', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '保險契約', 'description': None, 'type': 'Concept'},\n",
       "   {'id': '民國九十九年二月三日', 'description': None, 'type': 'Date'}],\n",
       "  'rels': [{'start': '未滿15足歲之未成年人',\n",
       "    'description': None,\n",
       "    'type': '變更為',\n",
       "    'end': '喪葬費用保險金'},\n",
       "   {'start': '未滿15足歲之未成年人',\n",
       "    'description': None,\n",
       "    'type': '給付',\n",
       "    'end': '喪葬費用保險金'},\n",
       "   {'start': '訂立本契約時',\n",
       "    'description': None,\n",
       "    'type': '以...為被保險人',\n",
       "    'end': '未滿15足歲之未成年人'},\n",
       "   {'start': '保險契約', 'description': None, 'type': '給付', 'end': '喪葬費用保險金'},\n",
       "   {'start': '民國九十九年二月三日', 'description': None, 'type': '訂立', 'end': '保險契約'}]}]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "community_info = graph.query(\"\"\"\n",
    "MATCH (c:`__Community__`)<-[:IN_COMMUNITY*]-(e:__Entity__)\n",
    "WHERE c.level IN [0,1,4]\n",
    "WITH c, collect(e ) AS nodes\n",
    "WHERE size(nodes) > 1\n",
    "CALL apoc.path.subgraphAll(nodes[0], {\n",
    " whitelistNodes:nodes\n",
    "})\n",
    "YIELD relationships\n",
    "RETURN c.id AS communityId, \n",
    "       [n in nodes | {id: n.id, description: n.description, type: [el in labels(n) WHERE el <> '__Entity__'][0]}] AS nodes,\n",
    "       [r in relationships | {start: startNode(r).id, type: type(r), end: endNode(r).id, description: r.description}] AS rels\n",
    "\"\"\")\n",
    "community_info"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "\n",
    "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
    "# from langchain_openai import ChatOpenAI\n",
    "from langchain_openai import AzureChatOpenAI\n",
    "\n",
    "llm = AzureChatOpenAI(\n",
    "    azure_endpoint=os.environ[\"AZURE_OPENAI_ENDPOINT\"],\n",
    "    azure_deployment=os.environ[\"AZURE_OPENAI_DEPLOYMENT_NAME\"],\n",
    "    openai_api_version=os.environ[\"AZURE_OPENAI_API_VERSION\"],\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "\n",
    "community_template = \"\"\"請根據提供同社區的資訊包含 nodes 與 relationships,\n",
    "產生自然語言的摘要 同社區的資訊:\n",
    "{community_info}\n",
    "\n",
    "Summary:\"\"\"  # noqa: E501\n",
    "\n",
    "community_prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            \"Given an input triples, generate the information summary. No pre-amble.\",\n",
    "        ),\n",
    "        (\"human\", community_template),\n",
    "    ]\n",
    ")\n",
    "\n",
    "community_chain = community_prompt | llm | StrOutputParser()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'community': '0-3',\n",
       " 'summary': '在這個社區中，有幾個重要的節點和關係。節點包括一個公司 (Company)，兩個人 (Policyholder 和 Insured)，以及一個概念 (Value-Added Feedback Bonus)。公司與被保險人 (Insured) 和保單持有人 (Policyholder) 之間存在累積退款的關係。此外，公司會以書面形式通知保單持有人。增值反饋獎金 (Value-Added Feedback Bonus) 則與購買額外付費保險和扣除保費相關，這些操作都是針對保單持有人的。'}"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def prepare_string(data):\n",
    "    nodes_str = \"Nodes are:\\n\"\n",
    "    for node in data['nodes']:\n",
    "        node_id = node['id']\n",
    "        node_type = node['type']\n",
    "        if 'description' in node and node['description']:\n",
    "            node_description = f\", description: {node['description']}\"\n",
    "        else:\n",
    "            node_description = \"\"\n",
    "        nodes_str += f\"id: {node_id}, type: {node_type}{node_description}\\n\"\n",
    "\n",
    "    rels_str = \"Relationships are:\\n\"\n",
    "    for rel in data['rels']:\n",
    "        start = rel['start']\n",
    "        end = rel['end']\n",
    "        rel_type = rel['type']\n",
    "        if 'description' in rel and rel['description']:\n",
    "            description = f\", description: {rel['description']}\"\n",
    "        else:\n",
    "            description = \"\"\n",
    "        rels_str += f\"({start})-[:{rel_type}]->({end}){description}\\n\"\n",
    "\n",
    "    return nodes_str + \"\\n\" + rels_str\n",
    "\n",
    "def process_community(community):\n",
    "    stringify_info = prepare_string(community)\n",
    "    summary = community_chain.invoke({'community_info': stringify_info})\n",
    "    return {\"community\": community['communityId'], \"summary\": summary}\n",
    "\n",
    "process_community(community_info[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Processing communities: 100%|██████████| 15/15 [00:06<00:00,  2.35it/s]\n"
     ]
    }
   ],
   "source": [
    "from concurrent.futures import ThreadPoolExecutor, as_completed\n",
    "from tqdm import tqdm\n",
    "\n",
    "summaries = []\n",
    "with ThreadPoolExecutor() as executor:\n",
    "    futures = {executor.submit(process_community, community): community for community in community_info}\n",
    "\n",
    "    for future in tqdm(as_completed(futures), total=len(futures), desc=\"Processing communities\"):\n",
    "        summaries.append(future.result())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'community': '0-27', 'summary': '從被保險人滿15足歲之日起，約定發生效力於死亡給付。'},\n",
       " {'community': '0-5',\n",
       "  'summary': '台灣人壽是一家提供保險產品的組織，其中包括美鑫美利美元利率變動型終身壽險。人們可以投保這種保險產品。'},\n",
       " {'community': '0-21', 'summary': '本公司是一個組織，它與身故保險金這一概念存在關聯。本公司負責給付身故保險金。'},\n",
       " {'community': '0-23',\n",
       "  'summary': '在這個社區中，有四個節點和三個關係。節點包括概念「書面通知」、「保險金額」、「電子郵件通知」，以及一個人「要保人」。關係方面，「書面通知」和「電子郵件通知」都通知了「要保人」。「要保人」則選擇了「保險金額」。'},\n",
       " {'community': '0-10',\n",
       "  'summary': '被保險人是一個人，其中包含一個保險年齡的屬性。這兩個節點之間的關係是，被保險人具有一個特定的保險年齡。'},\n",
       " {'community': '0-29',\n",
       "  'summary': '在這個社區中，有一個概念節點 \"保險契約\" 和一個日期節點 \"民國九十九年二月三日\"。這兩個節點之間存在一個關係，表示 \"民國九十九年二月三日\" 是 \"保險契約\" 訂立的日期。'},\n",
       " {'community': '0-18',\n",
       "  'summary': '在這個社區中，包含了一些重要的節點和關係：\\n\\n1. 節點:\\n- \"本契約終止\" (事件)\\n- \"受益人\" (人員)\\n- \"保險金\" (概念)\\n\\n2. 關係:\\n- \"本契約終止\" 事件發生後，\"受益人\" 會受領相關事宜。\\n- \"受益人\" 會受領 \"保險金\"。\\n\\n總結來說，當 \"本契約終止\" 時，\"受益人\" 將會受領到 \"保險金\"。'},\n",
       " {'community': '0-12',\n",
       "  'summary': '在這個社區中，我們有五個節點，分別是「儲存生息」、「保單年度」、「各年度之增值回饋分享金」、「宣告利率」和「年複利方式」。\\n\\n「儲存生息」會影響「各年度之增值回饋分享金」。「各年度之增值回饋分享金」與「保單年度」相關，並且在「保單年度」開始給付，同時這些回饋金會累積到「年複利方式」中。此外，「各年度之增值回饋分享金」是按月計算的，計算方式基於「宣告利率」。'},\n",
       " {'community': '0-25',\n",
       "  'summary': '在這個社區中，有三個主要元素：未滿15足歲之未成年人、訂立本契約時、喪葬費用保險金。未滿15足歲之未成年人是一個人（Person），訂立本契約時是一個事件（Event），而喪葬費用保險金是一個概念（Concept）。\\n\\n這些元素之間有三種關係：\\n1. 未滿15足歲之未成年人可以變更為喪葬費用保險金。\\n2. 未滿15足歲之未成年人會給付喪葬費用保險金。\\n3. 訂立本契約時會以未滿15足歲之未成年人為被保險人。'},\n",
       " {'community': '1-8',\n",
       "  'summary': '在民國九十九年二月三日，訂立了一份保險契約。此保險契約的給付對象包括喪葬費用保險金。當訂立這份契約時，被保險人是未滿15足歲之未成年人。未滿15足歲之未成年人在這個保險契約中有兩個重要的角色：一方面，他們可變更為喪葬費用保險金的受益人，另一方面，他們也是喪葬費用保險金的給付對象。'},\n",
       " {'community': '0-3',\n",
       "  'summary': '在這個社區中，有四個主要的節點：一個公司（Company）和三個不同類型的個人或概念節點，包括保單持有人（Policyholder）、增值反饋獎金（Value-Added Feedback Bonus）和被保險人（Insured）。\\n\\n公司（Company）與保單持有人和被保險人之間存在多種互動關係。公司會將累積金額退還給被保險人和保單持有人，並且會以書面形式通知保單持有人。\\n\\n增值反饋獎金（Value-Added Feedback Bonus）則與保單持有人之間存在兩種關係：它可以用來購買額外的已付保險，還可以用來扣除保費。\\n\\n總結來說，這個社區中的關係主要圍繞公司與保單持有人和被保險人進行的金錢退還及通知，以及增值反饋獎金對保單持有人保險的影響。'},\n",
       " {'community': '1-4',\n",
       "  'summary': '在這個社區中，有三個主要的節點和兩個關係。節點包括一個事件 \"本契約終止\"、一個人 \"受益人\" 和一個概念 \"保險金\"。這些節點之間的關係如下：\"本契約終止\" 事件與 \"受益人\" 有 \"受領\" 的關係，並且 \"受益人\" 與 \"保險金\" 也有 \"受領\" 的關係。總結來說，當本契約終止時，受益人將會受領保險金。'},\n",
       " {'community': '1-1',\n",
       "  'summary': '在這個社區中，有四個重要的節點和多個關係。節點包括一個公司的組織，一個保單持有人和一個被保險人，這兩者都是人，還有一個概念是增值反饋獎勵。\\n\\n公司會將累積的退款金額退還給保單持有人和被保險人。此外，公司還會以書面形式通知保單持有人。\\n\\n增值反饋獎勵則涉及到兩個主要行動：為保單持有人購買額外的已付保險，以及從中扣除保費。'},\n",
       " {'community': '1-3',\n",
       "  'summary': '在這個保險社區中，核心概念是「各年度之增值回饋分享金」，這些分享金是由「儲存生息」所影響的，並且會在「保單年度」內開始給付。「各年度之增值回饋分享金」按月由「宣告利率」計算，並以「年複利方式」累積。這些分享金會通知「要保人」透過「電子郵件通知」或「書面通知」，最終給付給「要保人」。\\n\\n「美鑫美利美元利率變動型終身壽險」包含了這些「各年度之增值回饋分享金」，而「台灣人壽」是提供這種保險產品的組織。「要保人」可以選擇「保險金額」，並進行「投保」這一行為，針對「美鑫美利美元利率變動型終身壽險」進行投保。\\n\\n「電子郵件通知」和「書面通知」會通知「要保人」有關「各年度之增值回饋分享金」的訊息，並且「投保」行為是「要保人」針對「美鑫美利美元利率變動型終身壽險」所進行的行動。'},\n",
       " {'community': '1-9',\n",
       "  'summary': '在這個社區中，有幾個重要的節點和關係。首先，節點包括「保險年齡」(Age)、「被保險人」(Person)、「被保險人滿15足歲之日起」(Event)、「死亡給付」(Concept)、「本公司」(Organization)以及「身故保險金」(Concept)。這些節點之間的關係如下：\\n\\n1. 被保險人會得到身故保險金。\\n2. 被保險人有一個特定的保險年齡。\\n3. 當被保險人滿15足歲之日起，約定的死亡給付效力開始生效。\\n4. 當被保險人滿15足歲之日起，效力開始於被保險人身上。\\n5. 本公司負責給付身故保險金。\\n\\n這些關係展示了被保險人、保險年齡、事件、概念及本公司之間的互動。'}]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "summaries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "UNWIND $data AS row\n",
    "MERGE (c:__Community__ {id:row.community})\n",
    "SET c.summary = row.summary\n",
    "\"\"\", params={\"data\": summaries})"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "lagch",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
